In [1]:
import pandas as pd
import numpy as np

# TITANIC DATASET

In [2]:
#load titanic dataset
df = pd.read_csv("C:/Users/HP/Documents/DS B/Titanic.csv")

In [3]:
#view top data
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
#view information of data
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [5]:
#view number of data not null
df.notnull().sum

<bound method NDFrame._add_numeric_operations.<locals>.sum of      PassengerId  Survived  Pclass  Name   Sex    Age  SibSp  Parch  Ticket  \
0           True      True    True  True  True   True   True   True    True
1           True      True    True  True  True   True   True   True    True
2           True      True    True  True  True   True   True   True    True
3           True      True    True  True  True   True   True   True    True
4           True      True    True  True  True   True   True   True    True
..           ...       ...     ...   ...   ...    ...    ...    ...     ...
886         True      True    True  True  True   True   True   True    True
887         True      True    True  True  True   True   True   True    True
888         True      True    True  True  True  False   True   True    True
889         True      True    True  True  True   True   True   True    True
890         True      True    True  True  True   True   True   True    True

     Fare  Cabin  Embarked
0    True  False      True
1    True   True      True
2    True  False      True
3    True   True      True
4    True  False      True
..    ...    ...       ...
886  True  False      True
887  True   True      True
888  True  False      True
889  True   True      True
890  True  False      True

[891 rows x 12 columns]>

In [6]:
#check missing data
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [7]:
#view the amount of data
df.sum()

C:\Users\HP\AppData\Local\Temp/ipykernel_1052/2857942903.py:2: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.sum()

PassengerId                                               397386
Survived                                                     342
Pclass                                                      2057
Name           Braund, Mr. Owen HarrisCumings, Mrs. John Brad...
Sex            malefemalefemalefemalemalemalemalemalefemalefe...
Age                                                     21205.17
SibSp                                                        466
Parch                                                        340
Ticket         A/5 21171PC 17599STON/O2. 31012821138033734503...
Fare                                                  28693.9493
dtype: object

In [8]:
#view data from below
df.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [9]:
#see number of rows and columns
df.shape

(891, 12)

In [10]:
#view the column
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [11]:
#view the index
df.index

RangeIndex(start=0, stop=891, step=1)

# TASK

In [12]:
#load the data 
data2 = pd.read_csv("Kel2.csv")

In [13]:
#view top 4 data
data2.head(4)

    Nama   Domisili        Hobi       Cita-Cita  Hewan Peliharaan  Usia
0   Jaza      Jogja       Masak       Pengusaha                10    22
1  Irvan  Palembang  Main gitar         Pemusik                 7    20
2  Risma   Semarang     Membaca  Data Scientist                 8    21
3  Rizal    Bandung      Nonton      Freelancer                 4    21

In [14]:
#view data info
data2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 6 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Nama              10 non-null     object
 1   Domisili          10 non-null     object
 2   Hobi              9 non-null      object
 3   Cita-Cita         9 non-null      object
 4   Hewan Peliharaan  10 non-null     int64
 5   Usia              10 non-null     int64
dtypes: int64(2), object(4)
memory usage: 608.0+ bytes

In [15]:
#view number of data not null
data2.notnull().sum

<bound method NDFrame._add_numeric_operations.<locals>.sum of    Nama  Domisili   Hobi  Cita-Cita  Hewan Peliharaan  Usia
0  True      True   True       True              True  True
1  True      True   True       True              True  True
2  True      True   True       True              True  True
3  True      True   True       True              True  True
4  True      True   True       True              True  True
5  True      True   True       True              True  True
6  True      True   True      False              True  True
7  True      True   True       True              True  True
8  True      True  False       True              True  True
9  True      True   True       True              True  True>

In [16]:
#check missing data
data2.isnull().sum()

Nama                0
Domisili            0
Hobi                1
Cita-Cita           1
Hewan Peliharaan    0
Usia                0
dtype: int64

In [17]:
#view the amount of data
data2.sum()

C:\Users\HP\AppData\Local\Temp/ipykernel_1052/4169609756.py:2: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  data2.sum()

Nama                 JazaIrvanRismaRizalShafiraArdiSintaBudiRaraAbdul
Domisili            JogjaPalembangSemarangBandungSurabayaSumbaTren...
Hewan Peliharaan                                                   47
Usia                                                              212
dtype: object

In [18]:
#view data from below
data2.tail()

    Nama    Domisili         Hobi  Cita-Cita  Hewan Peliharaan  Usia
5   Ardi       Sumba       Gambar    Pelukis                 1    21
6  Sinta  Trenggalek         Lari        NaN                 0    20
7   Budi       Papua       Menari     Penari                 3    23
8   Rara     Jakarta          NaN   Penyanyi                12    22
9  Abdul   Indramayu  Bulutangkis  Pedangdut                 0    21

In [19]:
#see number of rows and columns
data2.shape

(10, 6)

In [20]:
#view the column
data2.columns

Index(['Nama', 'Domisili', 'Hobi', 'Cita-Cita', 'Hewan Peliharaan', 'Usia'], dtype='object')

In [21]:
#view the index
data2.index

RangeIndex(start=0, stop=10, step=1)

# BACK TO TITANIC DATASET

In [22]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [23]:
#average
df['Age'].mean()

29.69911764705882

In [24]:
#minimum value
df['Age'].min()

0.42

In [25]:
#maximum value
df['Age'].max()

80.0

In [26]:
#mode
df['Age'].mode()[0]

24.0

In [27]:
#see NaN from age column
df[df.Age.isnull()]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
17,18,1,2,"Williams, Mr. Charles Eugene",male,NaN,0,0,244373,13.0000,NaN,S
19,20,1,3,"Masselmani, Mrs. Fatima",female,NaN,0,0,2649,7.2250,NaN,C
26,27,0,3,"Emir, Mr. Farred Chehab",male,NaN,0,0,2631,7.2250,NaN,C
28,29,1,3,"O'Dwyer, Miss. Ellen ""Nellie""",female,NaN,0,0,330959,7.8792,NaN,Q
...,...,...,...,...,...,...,...,...,...,...,...,...
859,860,0,3,"Razi, Mr. Raihed",male,NaN,0,0,2629,7.2292,NaN,C
863,864,0,3,"Sage, Miss. Dorothy Edith ""Dolly""",female,NaN,8,2,CA. 2343,69.5500,NaN,S
868,869,0,3,"van Melkebeke, Mr. Philemon",male,NaN,0,0,345777,9.5000,NaN,S
878,879,0,3,"Laleff, Mr. Kristo",male,NaN,0,0,349217,7.8958,NaN,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S

In [28]:
#then masking it
[df.Age.isnull()] #see NaN from age column

[0      False
 1      False
 2      False
 3      False
 4      False
        ...
 886    False
 887    False
 888     True
 889    False
 890    False
 Name: Age, Length: 891, dtype: bool]

In [29]:
#form a dataframe
df[df.Age.isnull()] #see NaN from age column

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
17,18,1,2,"Williams, Mr. Charles Eugene",male,NaN,0,0,244373,13.0000,NaN,S
19,20,1,3,"Masselmani, Mrs. Fatima",female,NaN,0,0,2649,7.2250,NaN,C
26,27,0,3,"Emir, Mr. Farred Chehab",male,NaN,0,0,2631,7.2250,NaN,C
28,29,1,3,"O'Dwyer, Miss. Ellen ""Nellie""",female,NaN,0,0,330959,7.8792,NaN,Q
...,...,...,...,...,...,...,...,...,...,...,...,...
859,860,0,3,"Razi, Mr. Raihed",male,NaN,0,0,2629,7.2292,NaN,C
863,864,0,3,"Sage, Miss. Dorothy Edith ""Dolly""",female,NaN,8,2,CA. 2343,69.5500,NaN,S
868,869,0,3,"van Melkebeke, Mr. Philemon",male,NaN,0,0,345777,9.5000,NaN,S
878,879,0,3,"Laleff, Mr. Kristo",male,NaN,0,0,349217,7.8958,NaN,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S

In [30]:
#view unique data from the sex column
df['Age'].unique()

array([22.  , 38.  , 26.  , 35.  ,   nan, 54.  ,  2.  , 27.  , 14.  ,
        4.  , 58.  , 20.  , 39.  , 55.  , 31.  , 34.  , 15.  , 28.  ,
        8.  , 19.  , 40.  , 66.  , 42.  , 21.  , 18.  ,  3.  ,  7.  ,
       49.  , 29.  , 65.  , 28.5 ,  5.  , 11.  , 45.  , 17.  , 32.  ,
       16.  , 25.  ,  0.83, 30.  , 33.  , 23.  , 24.  , 46.  , 59.  ,
       71.  , 37.  , 47.  , 14.5 , 70.5 , 32.5 , 12.  ,  9.  , 36.5 ,
       51.  , 55.5 , 40.5 , 44.  ,  1.  , 61.  , 56.  , 50.  , 36.  ,
       45.5 , 20.5 , 62.  , 41.  , 52.  , 63.  , 23.5 ,  0.92, 43.  ,
       60.  , 10.  , 64.  , 13.  , 48.  ,  0.75, 53.  , 57.  , 80.  ,
       70.  , 24.5 ,  6.  ,  0.67, 30.5 ,  0.42, 34.5 , 74.  ])

In [31]:
df.Age.value_counts()

24.00    30
22.00    27
18.00    26
19.00    25
28.00    25
         ..
36.50     1
55.50     1
0.92      1
23.50     1
74.00     1
Name: Age, Length: 88, dtype: int64

# TASK

In [32]:
#load data 
data2 = pd.read_csv("Kel2.csv")

In [33]:
data2.describe()

       Hewan Peliharaan       Usia
count         10.000000  10.000000
mean           4.700000  21.200000
std            4.295993   0.918937
min            0.000000  20.000000
25%            1.250000  21.000000
50%            3.500000  21.000000
75%            7.750000  21.750000
max           12.000000  23.000000

In [34]:
data2['Usia'].mean()

21.2

In [35]:
data2['Usia'].min()

20

In [36]:
data2['Usia'].max()

23

In [37]:
data2['Usia'].mode()[0]

21

In [38]:
data2[data2.Usia.isnull()]

Empty DataFrame
Columns: [Nama, Domisili, Hobi, Cita-Cita, Hewan Peliharaan, Usia]
Index: []

In [39]:
#masking it
[data2.Usia.isnull()] #see NaN from age column

[0    False
 1    False
 2    False
 3    False
 4    False
 5    False
 6    False
 7    False
 8    False
 9    False
 Name: Usia, dtype: bool]

In [40]:
#form the dataframe
data2[data2.Usia.isnull()] #see NaN from age column

Empty DataFrame
Columns: [Nama, Domisili, Hobi, Cita-Cita, Hewan Peliharaan, Usia]
Index: []

In [41]:
#view unique data from the usia column
data2['Usia'].unique()

array([22, 20, 21, 23], dtype=int64)

In [42]:
data2.Usia.value_counts()

21    5
22    2
20    2
23    1
Name: Usia, dtype: int64